---
type: ITemporaryGraphicsHandler
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# ITemporaryGraphicsHandler

`Autodesk.Revit.UI.ITemporaryGraphicsHandler` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnClick | 2022 | `void OnClick ( TemporaryGraphicsCommandData data )` |